apache/nuttx/arch/arm/src/tlsr82/tlsr82_serial.c
/****************************************************************************
 * arch/arm/src/tlsr82/tlsr82_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <errno.h>
#include <nuttx/config.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/compiler.h>
#include <nuttx/board.h>
#include <nuttx/semaphore.h>
#include <nuttx/serial/serial.h>
#include <arch/board/board.h>

#include <assert.h>
#include <debug.h>
#include <semaphore.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "arm_internal.h"

#include "hardware/tlsr82_gpio.h"
#include "hardware/tlsr82_register.h"
#include "tlsr82_spi_console.h"
#include "tlsr82_gpio.h"

#include "hardware/tlsr82_uart.h"
#include "hardware/tlsr82_dma.h"
#include "hardware/tlsr82_clock.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define UART_RAMCODE               locate_code(".ram_code")

#define CONSOLE_PORT               0
#define CONSOLE_PRIV               g_uart0priv
#define CONSOLE_DEV                g_uart0_dev

#define UART0_PIN_TX_MUX           BOARD_UART0_TX_MUX
#define UART0_PIN_RX_MUX           BOARD_UART0_RX_MUX

#define UART0_PIN_TX               BOARD_UART0_TX_PIN
#define UART0_PIN_RX               BOARD_UART0_RX_PIN

#define UART0_TX_BUF_SIZE          CONFIG_TLSR82_UART0_TX_BUF_SIZE
#define UART0_RX_BUF_SIZE          CONFIG_TLSR82_UART0_RX_BUF_SIZE

#define UART0_TXDMA_BUF_SIZE       CONFIG_TLSR82_UART0_TXDMA_BUF_SIZE
#define UART0_RXDMA_BUF_SIZE       CONFIG_TLSR82_UART0_RXDMA_BUF_SIZE

#define DMA_HEAD_LEN               4

#ifdef CONFIG_SERIAL_TXDMA
#  if UART0_TXDMA_BUF_SIZE > UINT8_MAX
#    error "UART0 Tx dma buffer size must less than 255"
#  endif

#  if (UART0_TXDMA_BUF_SIZE % 16) != 0
#    error "UART0 Tx dma buffer size must be multiple of 16"
#  endif

#  if UART0_TXDMA_BUF_SIZE < UART0_TX_BUF_SIZE
#    warning "UART0 Tx dma buffer size better larger than tx buffer size"
#  endif
#endif

#ifdef CONFIG_SERIAL_RXDMA
#  if UART0_RXDMA_BUF_SIZE > UINT8_MAX
#    error "UART0 Rx dma buffer size must less than 255"
#  endif

#  if (UART0_RXDMA_BUF_SIZE % 16) != 0
#    error "UART0 Rx dma buffer size must be multiple of 16"
#  endif

#  if UART0_RXDMA_BUF_SIZE < UART0_RX_BUF_SIZE
#    warning "UART0 Rx dma buffer size better larger than rx buffer size"
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

typedef struct
{
  uint32_t baud;
  uint32_t port;
  uint32_t irq;
  uint32_t txpin;
  uint32_t rxpin;
  uint32_t parity;
  uint32_t stopbits;
  bool     txdma;
  bool     rxdma;
#ifdef CONFIG_SERIAL_TXDMA
  sem_t   *txdmasem;
  char    *txdmabuf;
  uint32_t txdmasize;
#endif
#ifdef CONFIG_SERIAL_RXDMA
  char    *rxdmabuf;
  uint32_t rxdmasize;
  uint32_t rxdmaindex;
  uint32_t rxdmalen;
#endif
} uart_priv_t;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Uart interrupt handler */

static int UART_RAMCODE tlsr82_interrupt(int irq, void *context, void *arg);

#if defined(CONFIG_SERIAL_RXDMA) || defined(CONFIG_SERIAL_TXDMA)
static int UART_RAMCODE tlsr82_dma_interrupt(int irq, void *context,
                                             void *arg);
#endif

/* Uart operation function */

static int  tlsr82_uart_setup(struct uart_dev_s *dev);
static void tlsr82_uart_shutdown(struct uart_dev_s *dev);
static int  tlsr82_uart_attach(struct uart_dev_s *dev);
static void tlsr82_uart_detach(struct uart_dev_s *dev);
static int  tlsr82_uart_ioctl(struct file *filep, int cmd,
                              unsigned long arg);
static void tlsr82_uart_rxint(struct uart_dev_s *dev, bool enable);
static void tlsr82_uart_txint(uart_dev_t *dev, bool enable);
static int  UART_RAMCODE tlsr82_uart_receive(struct uart_dev_s *dev,
                                             unsigned int * status);
static bool UART_RAMCODE tlsr82_uart_rxavailable(struct uart_dev_s *dev);
static void UART_RAMCODE tlsr82_uart_send(struct uart_dev_s *dev, int ch);
static bool UART_RAMCODE tlsr82_uart_txready(struct uart_dev_s *dev);
static bool UART_RAMCODE tlsr82_uart_txempty(struct uart_dev_s *dev);

#ifdef CONFIG_SERIAL_RXDMA
static void tlsr82_uart_dma_rxint(struct uart_dev_s *dev, bool enable);
static int  UART_RAMCODE tlsr82_uart_dma_receive(struct uart_dev_s *dev,
                                                 unsigned int * status);
static bool UART_RAMCODE tlsr82_uart_dma_rxavail(struct uart_dev_s *dev);
#endif

#ifdef CONFIG_SERIAL_TXDMA
static void tlsr82_uart_dma_send(struct uart_dev_s *dev);
static void tlsr82_uart_dma_txavail(struct uart_dev_s *dev);
static void tlsr82_uart_dma_txint(struct uart_dev_s *dev, bool enable);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

