apache/nuttx/arch/arm/src/tlsr82/tlsr82_serial.c
static uint8_t uart_rxindex;
static uint8_t uart_txindex;

/* UART operations */

#if !defined(CONFIG_TLSR82_UART0_RXDMA) && \
    !defined(CONFIG_TLSR82_UART0_TXDMA)
static const struct uart_ops_s g_uart_ops =
{
  .setup       = tlsr82_uart_setup,
  .shutdown    = tlsr82_uart_shutdown,
  .attach      = tlsr82_uart_attach,
  .detach      = tlsr82_uart_detach,
  .ioctl       = tlsr82_uart_ioctl,
  .receive     = tlsr82_uart_receive,
  .rxint       = tlsr82_uart_rxint,
  .rxavailable = tlsr82_uart_rxavailable,
  .send        = tlsr82_uart_send,
  .txint       = tlsr82_uart_txint,
  .txready     = tlsr82_uart_txready,
  .txempty     = tlsr82_uart_txempty,
};
#elif defined(CONFIG_TLSR82_UART0_RXDMA) && \
      !defined(CONFIG_TLSR82_UART0_TXDMA)
static const struct uart_ops_s g_uart_rxdma_ops =
{
  .setup       = tlsr82_uart_setup,
  .shutdown    = tlsr82_uart_shutdown,
  .attach      = tlsr82_uart_attach,
  .detach      = tlsr82_uart_detach,
  .ioctl       = tlsr82_uart_ioctl,
  .receive     = tlsr82_uart_dma_receive,
  .rxint       = tlsr82_uart_dma_rxint,
  .rxavailable = tlsr82_uart_dma_rxavail,
  .send        = tlsr82_uart_send,
  .txint       = tlsr82_uart_txint,
  .txready     = tlsr82_uart_txready,
  .txempty     = tlsr82_uart_txempty,
};
#elif !defined(CONFIG_TLSR82_UART0_RXDMA) && \
      defined(CONFIG_TLSR82_UART0_TXDMA)
static const struct uart_ops_s g_uart_txdma_ops =
{
  .setup       = tlsr82_uart_setup,
  .shutdown    = tlsr82_uart_shutdown,
  .attach      = tlsr82_uart_attach,
  .detach      = tlsr82_uart_detach,
  .ioctl       = tlsr82_uart_ioctl,
  .receive     = tlsr82_uart_receive,
  .rxint       = tlsr82_uart_rxint,
  .rxavailable = tlsr82_uart_rxavailable,
  .send        = tlsr82_uart_send,
  .txint       = tlsr82_uart_dma_txint,
  .txready     = tlsr82_uart_txready,
  .txempty     = tlsr82_uart_txempty,
  .dmatxavail  = tlsr82_uart_dma_txavail,
  .dmasend     = tlsr82_uart_dma_send,
};
#else
static const struct uart_ops_s g_uart_rxtxdma_ops =
{
  .setup       = tlsr82_uart_setup,
  .shutdown    = tlsr82_uart_shutdown,
  .attach      = tlsr82_uart_attach,
  .detach      = tlsr82_uart_detach,
  .ioctl       = tlsr82_uart_ioctl,
  .receive     = tlsr82_uart_dma_receive,
  .rxint       = tlsr82_uart_dma_rxint,
  .rxavailable = tlsr82_uart_dma_rxavail,
  .send        = tlsr82_uart_send,
  .txint       = tlsr82_uart_dma_txint,
  .txready     = tlsr82_uart_txready,
  .txempty     = tlsr82_uart_txempty,
  .dmatxavail  = tlsr82_uart_dma_txavail,
  .dmasend     = tlsr82_uart_dma_send,
};
#endif

static char g_uart0rxbuffer[UART0_RX_BUF_SIZE];
static char g_uart0txbuffer[UART0_TX_BUF_SIZE];

#ifdef CONFIG_TLSR82_UART0_TXDMA
static char g_uart0txdmabuf[UART0_TXDMA_BUF_SIZE + DMA_HEAD_LEN] \
aligned_data(4);
static sem_t g_uart0txdmasem = SEM_INITIALIZER(1);
#endif

#ifdef CONFIG_TLSR82_UART0_RXDMA
static char g_uart0rxdmabuf[UART0_RXDMA_BUF_SIZE + DMA_HEAD_LEN] \
aligned_data(4);
#endif

/* Private UART config and state */

static uart_priv_t g_uart0priv =
{
  .baud       = 115200,
  .port       = 0,
  .irq        = NR_UART_IRQ,
  .parity     = 0,
  .stopbits   = 0,
  .txpin      = UART0_PIN_TX,
  .rxpin      = UART0_PIN_RX,
#ifdef CONFIG_TLSR82_UART0_TXDMA
  .txdma      = true,
  .txdmasem   = &g_uart0txdmasem,
  .txdmabuf   = g_uart0txdmabuf,
  .txdmasize  = UART0_TXDMA_BUF_SIZE,
#else
  .txdma      = false,
#endif
#ifdef CONFIG_TLSR82_UART0_RXDMA
  .rxdma      = true,
  .rxdmabuf   = g_uart0rxdmabuf,
  .rxdmasize  = UART0_RXDMA_BUF_SIZE,
  .rxdmalen   = 0,
  .rxdmaindex = 0,
#else
  .rxdma      = false,
#endif
};

/* UART device structure */

static uart_dev_t g_uart0_dev =
{
  .recv =
    {
      .size   = sizeof(g_uart0rxbuffer),
      .buffer = g_uart0rxbuffer,
    },
  .xmit =
    {
      .size   = sizeof(g_uart0txbuffer),
      .buffer = g_uart0txbuffer,
    },
#if defined(CONFIG_TLSR82_UART0_TXDMA) && defined(CONFIG_TLSR82_UART0_RXDMA)
  .ops  = &g_uart_rxtxdma_ops,
#elif defined(CONFIG_TLSR82_UART0_TXDMA) && !defined(CONFIG_TLSR82_UART0_RXDMA)
  .ops  = &g_uart_txdma_ops,
#elif !defined(CONFIG_TLSR82_UART0_TXDMA) && defined(CONFIG_TLSR82_UART0_RXDMA)
  .ops  = &g_uart_rxdma_ops,
#else
  .ops  = &g_uart_ops,
#endif
  .priv = &g_uart0priv,
};

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: uart_clr_rx_index
 *
 * Description:
 *   Clear the uart receive software pointer, this function must be called
 *   after wakeup from power-saving mode or reset uart.
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_clr_rx_index(int uart_num)
{
  uart_rxindex = 0;
}

/****************************************************************************
 * Name: uart_clr_tx_index
 *
 * Description:
 *   Clear the uart transimit software pointer, this function must be called
 *   after wakeup from power-saving mode or reset uart.
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_clr_tx_index(int uart_num)
{
  uart_txindex = 0;
}

/****************************************************************************
 * Name: uart_reset
 *
 * Description:
 *   Reset the uart hardware, the software pointer must be set to zero
 *   (function uart_clr_rx_index() must be called).
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_reset(int uart_num)
{
  RESET_RST0_REG |= RESET_RST0_UART;
  RESET_RST0_REG &= ~RESET_RST0_UART;
  uart_clr_rx_index(uart_num);
  uart_clr_tx_index(uart_num);
}

/****************************************************************************
 * Name: uart_get_rxfifo_num
 *
 * Description:
 *   Get the received data numbers in the rx fifo.
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   number
 *
 ****************************************************************************/

static inline uint8_t uart_get_rxfifo_num(int uart_num)
{
  return UART_GET_RX_BUF_CNT();
}

/****************************************************************************
 * Name: uart_get_txfifo_num
 *
 * Description:
 *   Get the transimit data numbers in the tx fifo.
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   number
 *
 ****************************************************************************/

static inline uint8_t uart_get_txfifo_num(int uart_num)
{
  return UART_GET_TX_BUF_CNT();
}

/****************************************************************************
 * Name: uart_get_irq_status
 *
 * Description:
 *   Get the uart interrupt status
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *   flags     - interrupt bit mask: UART_IRQ_TXDONE
 *                                   UART_IRQ_TXBUF
 *                                   UART_IRQ_RXDONE
 *                                   UART_IRQ_RXBUF
 *
 * Returned Values:
 *   interrupt status: 0, interrupt not occurred
 *                     1, interrupt occurred
 *
 ****************************************************************************/

static inline uint8_t uart_get_irq_status(int uart_num, uint8_t flags)
{
  return (UART_IRQ_REG & flags);
}

/****************************************************************************
 * Name: uart_irq_clr
 *
 * Description:
 *   Clear the uart interrupt status
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *   flag      - interrupt bit mask: UART_IRQ_CLR_RX
 *                                   UART_IRQ_CLR_TX
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_irq_clr(int uart_num, uint8_t flag)
{
  BM_SET(UART_IRQ_REG, flag);
}

/****************************************************************************
 * Name: uart_irq_rx_enable
 *
 * Description:
 *   Enable/Disable the uart rx interrupt
 *
 * Parameters:
 *   enable  - true : enable the rx interrupt
 *             false: disable the rx interrupt
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_irq_rx_enable(bool enable)
{
  if (enable)
    {
      UART_CTRL0_REG |= UART_CTRL0_RX_IRQ_EN;
    }
  else
    {
      UART_CTRL0_REG &= ~UART_CTRL0_RX_IRQ_EN;
    }
}

/****************************************************************************
 * Name: uart_irq_tx_enable
 *
 * Description:
 *   Enable/Disable the uart tx interrupt
 *
 * Parameters:
 *   enable  - true : enable the tx interrupt
 *             false: disable the tx interrupt
 *
 * Returned Values:
 *   void
 *
 ****************************************************************************/

static inline void uart_irq_tx_enable(bool enable)
{
  if (enable)
    {
      UART_CTRL0_REG |= UART_CTRL0_TX_IRQ_EN;
    }
  else
    {
      UART_CTRL0_REG &= ~UART_CTRL0_TX_IRQ_EN;
    }
}

/****************************************************************************
 * Name: uart_txbufirq_isenable
 *
 * Description:
 *   Check weather the uart tx buffer interrupt is enable or not
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   interrupt is enable or not: 1, enable
 *                               0, disable
 *
 ****************************************************************************/

static inline int uart_txbufirq_isenable(int uart_num)
{
  return (UART_CTRL0_REG & UART_CTRL0_TX_IRQ_EN);
}

/****************************************************************************
 * Name: uart_rxbufirq_isenable
 *
 * Description:
 *   Check weather the uart rx buffer interrupt is enable or not
 *
 * Parameters:
 *   uart_num  - the uart hardware index
 *
 * Returned Values:
 *   interrupt is enable or not: 1, enable
 *                               0, disable
 *
 ****************************************************************************/

