apache/nuttx/arch/arm/src/tlsr82/tlsr82_serial.c
  if ((UART_BUF_CNT1_REG & UART_BUF_CNT1_RX_ERR))
    {
      /* It will clear rx_fifo and rx_err_irq, rx_buff_irq, so it won't enter
       * rx_buff interrupt.
       */

      uart_irq_clr(priv->port, UART_IRQ_CLR_RX);

      /* uart_reset() clear hardware and software fifo index */

      uart_reset(priv->port);
    }

#ifdef CONFIG_SERIAL_TXDMA
  if (priv->txdma && uart_get_irq_status(priv->port, UART_IRQ_TXDONE) &&
      uart_txdoneirq_isenable(priv->port))
    {
      /* Clear txdone interrupt */

      UART_STATE_REG = BIT(7);

      /* Adjust the send bytes */

      dev->dmatx.nbytes += dev->dmatx.length;
      if (dev->dmatx.nlength)
        {
          /* Dma send */

          uart_dma_send(priv, dev->dmatx.nbuffer, dev->dmatx.nlength);

          /* Set length for next next completion */

          dev->dmatx.length  = dev->dmatx.nlength;
          dev->dmatx.nlength = 0;
        }
      else
        {
          /* No data to send, call uart_xmitchars_done() */

          uart_xmitchars_done(dev);

          /* Post the tx dma sem, the next dma transfer can start */

          nxsem_post(priv->txdmasem);
        }
    }
#else
  if (uart_get_irq_status(priv->port, UART_IRQ_TXBUF) &&
      uart_txbufirq_isenable(priv->port))
    {
      uart_xmitchars(dev);
    }
#endif

  if (uart_get_irq_status(priv->port, UART_IRQ_RXBUF) &&
      uart_rxbufirq_isenable(priv->port))
    {
      uart_recvchars(dev);
    }

  return OK;
}

/****************************************************************************
 * Name: tlsr82_dma_interrupt
 *
 * Description:
 *   This is the UART dma interrupt handler. When the dma transfer finish,
 *   this interrupt will occur. In this interrupt, we should call
 *   uart_recvchars() to receive the char from the dma buffer.
 *
 ****************************************************************************/

#if defined(CONFIG_SERIAL_RXDMA)
static int UART_RAMCODE tlsr82_dma_interrupt(int irq, void *context,
                                             void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  uart_priv_t       *priv = (uart_priv_t *)dev->priv;

  /* Check the uart dma rx interrupt status */

  if ((DMA_IRQ_STA_REG & DMA_CHAN_UART_RX) &&
      (DMA_IRQ_MASK_REG & DMA_CHAN_UART_RX))
    {
      /* Write 1 to clear the interrupt status */

      DMA_IRQ_STA_REG |= DMA_CHAN_UART_RX;

      /* The first 4 bytes in dma rx buffer indicates the received
       * data number, the real data start at DMA_HEAD_LEN
       * set rxdmalen be the total valid length (Include DMA HEADER)
       * set rxdmaindex be DMA_HEAD_LEN for skipping the DMA HEADER
       */

      priv->rxdmalen   = priv->rxdmabuf[0] + DMA_HEAD_LEN;
      priv->rxdmaindex = DMA_HEAD_LEN;

      /* Call uart_recvchars */

      uart_recvchars(dev);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may
 *   operate in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).
 *   The RX and TX interrupts are not enabled until the txint() and rxint()
 *   methods are called.
 *
 ****************************************************************************/

static int tlsr82_uart_attach(struct uart_dev_s *dev)
{
  int ret;
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

#ifdef CONFIG_SERIAL_RXDMA
  /* If the serial rx dma is enable, the dma interrupt must be used for
   * received.
   */

  ret = irq_attach(NR_DMA_IRQ, tlsr82_dma_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the rx dma interrupt, and Write 1 to clear the dma
       * interrupt status
       */

      DMA_IRQ_MASK_REG |= DMA_CHAN_UART_RX;
      DMA_IRQ_STA_REG  |= DMA_CHAN_UART_RX;

      up_enable_irq(NR_DMA_IRQ);
    }
#endif

  ret = irq_attach(priv->irq, tlsr82_interrupt, dev);
  if (ret == OK)
    {
      uart_irq_clr(priv->port, UART_IRQ_CLR_RX);
      uart_clr_rx_index(priv->port);

#ifndef CONFIG_SERIAL_RXDMA
      /* Enable the rx fifo not empty irq, but when serial rx dma
       * is enable, rx fito not empty interrupt is not used, so
       * disable it.
       */

      uart_irq_rx_enable(true);
#endif

#ifdef CONFIG_SERIAL_TXDMA
      /* Enable the tx dma irq and clear the txdone status */

      UART_RXTIMEOUT1_REG |= UART_RXTIMEOUT1_MASK_TXDONE;
      UART_STATE_REG       = BIT(7);
#endif

      up_enable_irq(NR_UART_IRQ);
    }

  return ret;
}

/****************************************************************************
 * Name: tlsr82_uart_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.
 *   The exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void tlsr82_uart_detach(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  /* Disable interrupts */

  up_disable_irq(priv->irq);

  /* Detach from the interrupt(s) */

  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: tlsr82_uart_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int tlsr82_uart_ioctl(struct file *filep, int cmd, unsigned long arg)
{
  UNUSED(filep);
  UNUSED(cmd);
  UNUSED(arg);

  return -ENOTTY;
}

/****************************************************************************
 * Name: tlsr82_uart_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the UART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

