apache/nuttx/arch/arm/src/tlsr82/tlsr82_serial.c
static int UART_RAMCODE tlsr82_uart_receive(struct uart_dev_s *dev,
                                            unsigned int *status)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  /* Return receiver control information */

  if (status)
    {
      *status = 0x00;
    }

  /* Then return the actual received data. */

  return uart_read_byte(priv->port);
}

/****************************************************************************
 * Name: tlsr82_uart_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

static void tlsr82_uart_rxint(struct uart_dev_s *dev, bool enable)
{
  uart_irq_rx_enable(enable);
}

/****************************************************************************
 * Name: tlsr82_uart_rxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

static bool UART_RAMCODE tlsr82_uart_rxavailable(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  /* Return true if the receive buffer/fifo is not "empty." */

  return 0 != uart_get_rxfifo_num(priv->port);
}

/****************************************************************************
 * Name: tlsr82_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void tlsr82_uart_txint(uart_dev_t *dev, bool enable)
{
  uart_irq_tx_enable(enable);
}

/****************************************************************************
 * Name: tlsr82_uart_dma_rxint
 *
 * Description:
 *   Control the uart rx interrupt in UART RX DMA mode, but here nothing
 *   to be done.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_RXDMA
static void tlsr82_uart_dma_rxint(struct uart_dev_s *dev, bool enable)
{
  /* Nothing */
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_dma_receive
 *
 * Description:
 *   Receive the data from uart rx dma buffer, and increase the rx dma index
 *
 * Parameters:
 *   dev    - uart driver device pointer
 *   status - driver not used
 *
 * Returned Values:
 *   received char
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_RXDMA
static int  UART_RAMCODE tlsr82_uart_dma_receive(struct uart_dev_s *dev,
                                                 unsigned int * status)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;
  int ch;

  ch = (int)priv->rxdmabuf[priv->rxdmaindex];
  priv->rxdmaindex++;

  return ch;
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_dma_rxavail
 *
 * Description:
 *   Receive the data from uart rx dma buffer, and increase the rx dma index
 *
 * Parameters:
 *   dev    - uart driver device pointer
 *
 * Returned Values:
 *   true : uart rx available
 *   false: uart rx not available
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_RXDMA
static bool UART_RAMCODE tlsr82_uart_dma_rxavail(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  return priv->rxdmaindex < priv->rxdmalen;
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_send
 *
 * Description:
 *   This method will send one byte on the UART.
 *
 ****************************************************************************/

static void UART_RAMCODE tlsr82_uart_send(struct uart_dev_s *dev, int ch)
{
  uart_send_byte((uint8_t)ch);
}

/****************************************************************************
 * Name: tlsr82_txready
 *
 * Description:
 *   Return true if the tranmsit data register is empty
 *
 ****************************************************************************/

static bool UART_RAMCODE tlsr82_uart_txready(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  /* Return true if the transmit FIFO is "not full." */

  return uart_get_txfifo_num(priv->port) < 8;
}

/****************************************************************************
 * Name: tlsr82_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool UART_RAMCODE tlsr82_uart_txempty(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  /* Return true if the transmit FIFO is "empty." */

  return 0 == uart_get_txfifo_num(priv->port);
}

/****************************************************************************
 * Name: tlsr82_uart_dma_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts from the UART.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TXDMA
static void tlsr82_uart_dma_txint(struct uart_dev_s *dev, bool enable)
{
  /* Nothing to do. */

  /* In case of DMA transfer we do not want to make use of UART interrupts.
   * Instead, we use DMA interrupts that are activated once during boot
   * sequence. Furthermore we can use up_dma_txcallback() to handle staff at
   * half DMA transfer or after transfer completion (depending configuration,
   * see stm32_dmastart(...)).
   */
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_dma_send
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TXDMA
static void tlsr82_uart_dma_send(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  uart_dma_send(priv, dev->dmatx.buffer, dev->dmatx.length);
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_dma_txavail
 *
 * Description:
 *   Informs DMA that Tx data is available and is ready for transfer.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TXDMA
static void tlsr82_uart_dma_txavail(struct uart_dev_s *dev)
{
  uart_priv_t *priv = (uart_priv_t *)dev->priv;

  if (dev->xmit.head == dev->xmit.tail)
    {
      /* No data to transfer. */

      return;
    }

