apache/nuttx/arch/arm/src/tlsr82/tlsr82_serial.c
  /* Wait for the previous dma transfer finish */

  nxsem_wait(priv->txdmasem);
  uart_xmitchars_dma(dev);
}
#endif

/****************************************************************************
 * Name: tlsr82_uart_lowputc
 *
 * Description:
 *   Direct put the char into the uart tx fifo
 *
 * Parameters:
 *   ch - output char
 *
 * Return Value:
 *   Output char.
 *
 ****************************************************************************/

static inline int tlsr82_uart_lowputc(int ch)
{
  /* Wait until the tx fifo is not full */

  while (uart_get_txfifo_num(CONSOLE_PORT) > 7);

  tlsr82_uart_send(&CONSOLE_DEV, ch);

  return ch;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug
 *   writes
 *
 ****************************************************************************/

#ifndef CONFIG_TLSR82_SPI_SYSLOG
void up_putc(int ch)
{
  tlsr82_uart_lowputc(ch);
}
#endif

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes that
 *   arm_earlyserialinit was called previously.
 *
 ****************************************************************************/

void arm_serialinit(void)
{
  /* Register the serial console */

#ifndef CONFIG_TLSR82_SPI_CONSOLE
  CONSOLE_DEV.isconsole = true;
  uart_register("/dev/console", &CONSOLE_DEV);
#else
  spi_console_init();
#endif /* CONFIG_TLSR82_SPI_CONSOLE */

  /* Register the serial driver */

  uart_register("/dev/ttyS0", &g_uart0_dev);
}

/****************************************************************************
 * Name: tlsr82_earlyserialinit
 *
 * Description:
 *   Performs the low level UART initialization early in
 *   debug so that the serial console will be available
 *   during boot up.  This must be called before arm_serialinit.
 *
 ****************************************************************************/

void tlsr82_earlyserialinit(void)
{
  tlsr82_uart_setup(&CONSOLE_DEV);
}
